Revit 2015 API
ContFootingTypeSet.Insert Method
Insert the specified ContFooting type into the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public virtual bool Insert(
	ContFootingType item
)
Visual Basic
Public Overridable Function Insert ( _
	item As ContFootingType _
) As Boolean
Visual C++
public:
virtual bool Insert(
	ContFootingType^ item
)
Parameters
item
Type: Autodesk.Revit.DB.ContFootingType
The ContFooting type to be inserted into the set.
Return Value
Returns whether the ContFooting type was inserted into the set.
See Also
ContFootingTypeSet Class
Autodesk.Revit.DB Namespace